/*
*******************************************************************************
*                     ����Ƶ�ʼƣ���Ƶ�����ܣ�
*
* �ļ����ƣ�LCD12864.c
* ��    �ܣ�12864ͼ��Һ������ģ��
* ˵    ����ST7920������������8λģʽ������KST-51������
*         ֧���ַ���ʾ��ͼ����ʾ���ϵ��Զ���ʼ��
*******************************************************************************
*/

#include "config.h"
#include "LCD12864.h"

/* �ȴ�Һ��׼���ã�æ��⣩ */
void LcdWaitReady()
{
    uint8 sta;

    LCD12864_DB = 0xFF;
    LCD12864_RS = 0;
    LCD12864_RW = 1;
    do {
        LCD12864_E = 1;
        sta = LCD12864_DB;      // ��ȡ״̬��
        LCD12864_E = 0;
    } while (sta & 0x80);       // bit7Ϊ1��ʾҺ��æ���ظ����ֱ��Ϊ0
}

/* ��Һ��д��һ�ֽ����cmd-��д������ֵ */
void LcdWriteCmd(uint8 cmd)
{
    LcdWaitReady();
    LCD12864_RS = 0;            // RS=0 ѡ��ָ��Ĵ���
    LCD12864_RW = 0;            // RW=0 д����
    LCD12864_DB = cmd;          // �ͳ�����
    LCD12864_E  = 1;            // ʹ������
    LCD12864_E  = 0;
}

/* ��Һ��д��һ�ֽ����ݣ�dat-��д������ֵ */
void LcdWriteDat(uint8 dat)
{
    LcdWaitReady();
    LCD12864_RS = 1;            // RS=1 ѡ�����ݼĴ���
    LCD12864_RW = 0;            // RW=0 д����
    LCD12864_DB = dat;          // �ͳ�����
    LCD12864_E  = 1;            // ʹ������
    LCD12864_E  = 0;
}

/*
* �������ƣ�LcdShowString
* ��    �ܣ�����Ļ��ָ��λ����ʾһ���ַ���
* ��    ����str - ����ʾ�ַ���ָ��
*           x   - ��Ļ��ʾ������(����Ϊ��λ)
*           y   - ��Ļ��ʾ������(����Ϊ��λ)
* ע    �⣺�ַ��������C���Թ淶����'\0'-NULLΪ������ʶ
*           x��y����뵽16������������ȫ���ַ�(16*16pixel)Ϊ������λ
*/
void LcdShowString(uint8 x, uint8 y, uint8 *str)
{
    uint8 addr;

    // �����ַ���ʾλ�õ�DDRAM��ַ
    x >>= 4;   // x����16������Ϊ�ַ�������
    y >>= 4;   // y����16������Ϊ�ַ�������
    if (y >= 2)
    {
        y -= 2;
        x += 8;
    }
    addr = y * 16 + x;

    // ������ʼDDRAM��ַ����ʼд���ַ���
    LcdWriteCmd(0x30);          // �л�������ָ�
    LcdWriteCmd(0x80 | addr);   // ����DDRAM��ַ
    while (*str != '\0')
    {
        LcdWriteDat(*str);      // ���ֽ�д��
        str++;
    }
}

/*
* �������ƣ�LcdShowImage
* ��    �ܣ�����Ļ����ʾһ��ͼ��
* ��    ����img - ����ʾͼ������ָ��
*           x   - ��Ļ��ʾ������(����Ϊ��λ)
*           y   - ��Ļ��ʾ������(����Ϊ��λ)
*           w   - ͼ�����(����Ϊ��λ)
*           h   - ͼ��߶�(����Ϊ��λ)
* ע    �⣺x��w�����16����������GDRAMˮƽѰַ��λΪ2�ֽڣ�
*           y��hΪ0~63֮������ֵ
*/
void LcdShowImage(uint8 x, uint8 y, uint8 w, uint8 h, uint8 *img)
{
    int16 i;
    uint8 xi, yi;
    uint8 xt, yt;

    x >>= 4;
    w >>= 3;
    i = 0;
    LcdWriteCmd(0x36);
    for (yi = 0; yi < h; yi++)
    {
        yt = y + yi;
        xt = x;
        if (yt >= 32)
        {
            yt -= 32;
            xt += 8;
        }
        LcdWriteCmd(0x80 | yt);
        LcdWriteCmd(0x80 | xt);
        for (xi = 0; xi < w; xi++)
        {
            LcdWriteDat(img[i++]);
        }
    }
}

/*
* �������ƣ�LcdClearArea
* ��    �ܣ������Ļ�ϵ�һ��ͼ����ʾ�������0x00��
* ��    ����x - ������ʼ������(����Ϊ��λ)
*           y - ������ʼ������(����Ϊ��λ)
*           w - �������(����Ϊ��λ)
*           h - ����߶�(����Ϊ��λ)
*/
void LcdClearArea(uint8 x, uint8 y, uint8 w, uint8 h)
{
    uint8 xi, yi;
    uint8 xt, yt;

    x >>= 4;
    w >>= 3;
    LcdWriteCmd(0x36);
    for (yi = 0; yi < h; yi++)
    {
        yt = y + yi;
        xt = x;
        if (yt >= 32)
        {
            yt -= 32;
            xt += 8;
        }
        LcdWriteCmd(0x80 | yt);
        LcdWriteCmd(0x80 | xt);
        for (xi = 0; xi < w; xi++)
        {
            LcdWriteDat(0x00);
        }
    }
}

/* 12864Һ����ʼ������ */
void InitLcd12864()
{
    uint8 x, y;

    // === �ַ�ģʽ��ʼ�� ===
    LcdWriteCmd(0x30);   // ����ָ���8λ����
    LcdWriteCmd(0x01);   // �����������ʾ
    LcdWriteCmd(0x02);   // ��ַ��λ
    LcdWriteCmd(0x0C);   // ������ʾ�������أ�����˸

    // === ͼ��ģʽ��ʼ�� ===
    LcdWriteCmd(0x34);
    for (y = 0; y < 32; y++)
    {
        LcdWriteCmd(0x80 | y);
        LcdWriteCmd(0x80 | 0);
        for (x = 0; x < 32; x++)
        {
            LcdWriteDat(0x00);
        }
    }
    LcdWriteCmd(0x36);
}
